#### Link do desafio no Kaggle:
https://www.kaggle.com/c/titanic/overview/description

#### DESAFIO:
A competição é simples: use o aprendizado de máquina para criar um modelo que preveja quais passageiros
sobreviveram ao naufrágio do Titanic.

Nesse desafio, pedimos que você construa um modelo preditivo que responda à pergunta: 
"que tipo de pessoas têm mais probabilidade de sobreviver?" usando dados de passageiros (nome, idade, sexo, classe socioeconômica etc.).

##### Titanic Tutorial:
https://www.kaggle.com/alexisbcook/titanic-tutorial
    
##### Série de tutoriais do Titanic para iniciantes!:
https://www.kaggle.com/c/titanic/discussion/141477

##### Arquivos
Arquivo train.css é para treinar o algoritmo.
Arquivo test.csv é para testar o quanto o algoritmo acertou ou não.
Arquivo gender_submission assume que todas as passageiras sobreviveram (e todos os passageiros morreram).
Esse é um primeiro palpite razoável? Vamos verificar se esse padrão é verdadeiro nos dados (em train.csv).

#### Importar bibliotecas!

In [4]:
import numpy as np # Álgebra Linear
import pandas as pd # Processamento de dados, CSV f

#### Carregamento dos dados!

In [9]:
uri_train  = 'C:/Users/garci/PycharmProjects/Python-projetos-Disco-C-PyCharm/Projetos-Jupyter/Kaggle/1-desafio-titanic-kaggle/dados/train.csv'
uri_test = 'C:/Users/garci/PycharmProjects/Python-projetos-Disco-C-PyCharm/Projetos-Jupyter/Kaggle/1-desafio-titanic-kaggle/dados/test.csv'
uri_tes_gender_submission = 'C:/Users/garci/PycharmProjects/Python-projetos-Disco-C-PyCharm/Projetos-Jupyter/Kaggle/1-desafio-titanic-kaggle/dados/gender_submission.csv'

train = pd.read_csv(uri_train)
test = pd.read_csv(uri_test)
gender = pd.read_csv(uri_tes_gender_submission)

In [6]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [12]:
train.shape # linhas e colunas

(891, 12)